# **Project_1 : E-Commerce Churn Prediction Analysis**

### **data Inseting and Cleaning**

In [34]:
# Inserting Data
import pandas as pd
import numpy as np
du = pd.read_csv(r"F:\Project\e_commerce_project_1\dataset_1\ecommerce_dataset\users.csv")
du
do = pd.read_csv(r"F:\Project\e_commerce_project_1\dataset_1\ecommerce_dataset\orders.csv")
dp = pd.read_csv(r"F:\Project\e_commerce_project_1\dataset_1\ecommerce_dataset\products.csv")
dr = pd.read_csv(r"F:\Project\e_commerce_project_1\dataset_1\ecommerce_dataset\reviews.csv")
di = pd.read_csv(r"F:\Project\e_commerce_project_1\dataset_1\ecommerce_dataset\order_items.csv")
de = pd.read_csv(r"F:\Project\e_commerce_project_1\dataset_1\ecommerce_dataset\events.csv")

In [2]:

du['loyalty_tier'] = du['loyalty_tier'].fillna('Unknown')
du.loyalty_tier.unique()

array(['Silver', 'Unknown', 'Platinum', 'Gold'], dtype=object)

In [37]:
du['signup_date']=pd.to_datetime(du.signup_date)

In [35]:
du.head(10) # user's table

,user_id,name,email,gender,city,signup_date
0,U000001,Angel Hill,donaldgarcia@example.net,Other,New Roberttown,2025-03-13
1,U000002,Jesse Guzman,jennifermiles@example.com,Male,South Bridget,2024-03-05
2,U000003,Adam Shaffer,jpeterson@example.org,Male,Curtisfurt,2025-07-07
3,U000004,Melanie Munoz,blairamanda@example.com,Other,New Kellystad,2024-03-07
4,U000005,Janet Williams,kendragalloway@example.org,Female,South Joshuastad,2025-01-29
5,U000006,Michael Santiago,lynchgeorge@example.net,Male,East Steven,2024-04-21
6,U000007,Sara Watts,gabriellecameron@example.org,Male,Port Antonio,2024-07-03
7,U000008,Joseph Clark,jason76@example.net,Male,Thomasberg,2024-08-03
8,U000009,Anna Baker,zhurst@example.com,Other,East William,2024-06-17
9,U000010,Brandon Rodriguez,laurahenderson@example.org,Male,Jamesmouth,2024-03-03

In [38]:
du.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   user_id      10000 non-null  object
 1   name         10000 non-null  object
 2   email        10000 non-null  object
 3   gender       10000 non-null  object
 4   city         10000 non-null  object
 5   signup_date  10000 non-null  datetime64[ns]
dtypes: datetime64[ns](1), object(5)
memory usage: 468.9+ KB

In [39]:
do.head(10) # orders table

    order_id  user_id                  order_date order_status  total_amount
0  O00000001  U009310  2025-09-09T14:52:37.292731   processing        689.66
1  O00000002  U003247  2025-04-15T01:18:27.193404    completed       1666.85
2  O00000003  U007252  2025-04-27T15:37:48.008624   processing        665.06
3  O00000004  U008986  2025-10-04T20:35:22.204857    cancelled        689.50
4  O00000005  U008537  2024-11-13T08:15:18.498252    cancelled        860.50
5  O00000006  U003449  2024-10-13T09:02:26.848944    completed       2258.34
6  O00000007  U006985  2024-05-01T04:44:56.418188     returned        769.71
7  O00000008  U007661  2024-03-03T23:33:22.844913    completed         15.21
8  O00000009  U000610  2025-10-29T07:00:11.203638    cancelled        229.02
9  O00000010  U003175  2024-08-13T07:04:24.298799     returned        107.63

In [41]:
do['order_date']= pd.to_datetime(do.order_date)

In [44]:
do.order_status.unique()

array(['processing', 'completed', 'cancelled', 'returned', 'shipped'],
      dtype=object)

In [43]:
do['order_status'].value_counts()

order_status
shipped       4113
returned      4066
completed     4021
cancelled     3920
processing    3880
Name: count, dtype: int64

In [42]:
do.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   order_id      20000 non-null  object
 1   user_id       20000 non-null  object
 2   order_date    20000 non-null  datetime64[ns]
 3   order_status  20000 non-null  object
 4   total_amount  20000 non-null  float64
dtypes: datetime64[ns](1), float64(1), object(3)
memory usage: 781.4+ KB

In [45]:
do.describe()

                          order_date  total_amount
count                          20000  20000.000000
mean   2024-12-06 19:27:11.857592064    595.933447
min       2024-01-01 00:14:17.631198      1.110000
25%    2024-06-19 04:22:49.692361216    111.355000
50%    2024-12-05 10:04:04.342068480    308.195000
75%    2025-05-27 04:33:50.669431552    768.195000
max       2025-11-14 23:17:25.548939   7950.740000
std                              NaN    776.063336

In [46]:
dr.head(10) # review table

,review_id,order_id,product_id,user_id,rating,review_text,review_date
0,R00000528,O00000237,P001326,U001094,2,Color was different from images.,2025-10-14T12:03:56.749446
1,R00005792,O00002627,P000329,U001858,4,Highly recommend this brand.,2024-10-09T08:04:50.171793
2,R00036604,O00016798,P001160,U008109,4,Highly recommend this brand.,2024-06-03T05:11:16.787214
3,R00040163,O00018414,P001427,U006835,5,Highly recommend this brand.,2024-02-12T06:41:50.215810
4,R00031127,O00014300,P001639,U007148,3,Item arrived damaged.,2025-01-20T05:32:09.398860
5,R00012121,O00005571,P000545,U008471,2,Item arrived damaged.,2025-03-23T06:43:41.296484
6,R00000603,O00000268,P001726,U005394,4,"Not as expected, quality is poor.",2025-01-01T11:49:13.243196
7,R00010126,O00004654,P001747,U009810,2,"Excellent product, will buy again.",2025-09-07T13:15:38.158573
8,R00033877,O00015558,P000255,U004269,4,Decent product for the price.,2024-09-09T21:51:41.344570
9,R00019035,O00008786,P001146,U003737,4,Item arrived damaged.,2025-03-13T01:50:37.077642

In [47]:
dr['review_date']=pd.to_datetime(dr.review_date)

In [14]:
dr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   review_id    3000 non-null   object
 1   order_id     3000 non-null   object
 2   product_id   3000 non-null   object
 3   user_id      3000 non-null   object
 4   rating       3000 non-null   int64
 5   review_text  3000 non-null   object
 6   review_date  3000 non-null   datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(5)
memory usage: 164.2+ KB

In [48]:
dp.head(10) # product table

  product_id     product_name        category    brand   price  rating
0    P000001         Astra Be        Clothing    Astra  157.89    4.08
1    P000002  NeoTech Someone       Groceries  NeoTech   21.46    3.87
2    P000003     Acme Discuss          Sports     Acme  265.37    3.46
3    P000004     Nimbus South     Electronics   Nimbus  541.41    4.14
4    P000005    Astra Capital  Home & Kitchen    Astra  198.00    3.97
5    P000006     NeoTech When            Toys  NeoTech   18.61    3.20
6    P000007    Zenith School            Toys   Zenith   81.17    2.61
7    P000008   Everest Friend        Clothing  Everest   33.86    2.93
8    P000009        Harbor Go  Home & Kitchen   Harbor  253.18    4.44
9    P000010      Orion Ahead          Sports    Orion  235.11    3.47

In [49]:
dp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   product_id    2000 non-null   object
 1   product_name  2000 non-null   object
 2   category      2000 non-null   object
 3   brand         2000 non-null   object
 4   price         2000 non-null   float64
 5   rating        2000 non-null   float64
dtypes: float64(2), object(4)
memory usage: 93.9+ KB

In [50]:
di.head(10) #orders items

,order_item_id,order_id,product_id,user_id,quantity,item_price,item_total
0,I00000001,O00000001,P001758,U009310,2,8.07,16.14
1,I00000002,O00000001,P001119,U009310,1,74.08,74.08
2,I00000003,O00000001,P001794,U009310,1,576.97,576.97
3,I00000004,O00000001,P001038,U009310,1,22.47,22.47
4,I00000005,O00000002,P000859,U003247,1,422.22,422.22
5,I00000006,O00000002,P000803,U003247,1,953.03,953.03
6,I00000007,O00000002,P000324,U003247,1,60.11,60.11
7,I00000008,O00000002,P000454,U003247,1,231.49,231.49
8,I00000009,O00000003,P001344,U007252,1,103.47,103.47
9,I00000010,O00000003,P000919,U007252,1,33.99,33.99

In [51]:
di.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43525 entries, 0 to 43524
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   order_item_id  43525 non-null  object
 1   order_id       43525 non-null  object
 2   product_id     43525 non-null  object
 3   user_id        43525 non-null  object
 4   quantity       43525 non-null  int64
 5   item_price     43525 non-null  float64
 6   item_total     43525 non-null  float64
dtypes: float64(2), int64(1), object(4)
memory usage: 2.3+ MB

In [52]:
de.head(10)

    event_id  user_id product_id event_type             event_timestamp
0  E00000001  U009798    P001393       cart  2025-07-08T14:28:55.893919
1  E00000002  U005881    P000669       view  2025-10-19T23:00:44.067982
2  E00000003  U006348    P001404       view  2025-05-09T07:02:42.256662
3  E00000004  U002664    P000400       cart  2025-07-19T22:47:07.019634
4  E00000005  U005776    P000392       view  2024-10-24T10:20:33.602165
5  E00000006  U002711    P001643       view  2024-12-20T11:02:39.321604
6  E00000007  U003726    P000370       view  2024-06-06T05:16:39.778558
7  E00000008  U002658    P001221       view  2025-03-31T05:39:53.288602
8  E00000009  U001433    P000240       view  2024-10-17T08:29:00.460950
9  E00000010  U000431    P000652       view  2024-10-27T10:56:00.683131

In [56]:
de['event_timestamp']=pd.to_datetime(de.event_timestamp)

In [57]:
de.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80000 entries, 0 to 79999
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   event_id         80000 non-null  object
 1   user_id          80000 non-null  object
 2   product_id       80000 non-null  object
 3   event_type       80000 non-null  object
 4   event_timestamp  80000 non-null  datetime64[ns]
dtypes: datetime64[ns](1), object(4)
memory usage: 3.1+ MB

In [58]:
de.event_type.unique()

array(['cart', 'view', 'wishlist', 'purchase'], dtype=object)

In [60]:
do.head()

    order_id  user_id                 order_date order_status  total_amount
0  O00000001  U009310 2025-09-09 14:52:37.292731   processing        689.66
1  O00000002  U003247 2025-04-15 01:18:27.193404    completed       1666.85
2  O00000003  U007252 2025-04-27 15:37:48.008624   processing        665.06
3  O00000004  U008986 2025-10-04 20:35:22.204857    cancelled        689.50
4  O00000005  U008537 2024-11-13 08:15:18.498252    cancelled        860.50

In [65]:
customer=du
orders=do
reviews=dr
product=dp
order_item=do
events=de

In [66]:
from sqlalchemy import create_engine
import pandas as pd
engine=create_engine("postgresql+psycopg2://postgres:arpita@localhost:5432/project_1")
customer.to_sql(name="customer",con=engine,if_exists="replace",index=False)
orders.to_sql(name="orders",con=engine,if_exists="replace",index=False)
reviews.to_sql(name="reviews",con=engine,if_exists="replace",index=False)
product.to_sql(name="product",con=engine,if_exists="replace",index=False)
order_item.to_sql(name="order_item",con=engine,if_exists="replace",index=False)
events.to_sql(name="events",con=engine,if_exists="replace",index=False)

1000